var SqlQueryUtils = require('../utils/SqlQueryUtils');


var MonsterItemModel = {
    tableName: 'm_monster_item',
    tableFields: [
        'id',
        'name',
        'dai',
        'yaoli',
        'fid',
        'mid',
        'create_time',
        'update_time'
    ]
};


async function insertMonsterItem(itemObject) {
    return SqlQueryUtils.doInsertByModelAsync(MonsterItemModel, itemObject);
}


async function insertOrUpdate(itemObject) {
    var id = itemObject['id'];
    var mm = await SqlQueryUtils.doQueryByIdAsync(MonsterItemModel,id);

    if(mm){
        return SqlQueryUtils.doUpdateByModelAsync(MonsterItemModel,itemObject,id);
    }else {
        return SqlQueryUtils.doInsertByModelAsync(MonsterItemModel,itemObject);
    }
}


async function getTop100RankList() {
    return await SqlQueryUtils.doQueryCacheAsync({
         sql: "select * from  " + MonsterItemModel.tableName + " order by yaoli desc limit 0,100"
    },"MonsterService_getTop100RankList",3600);
}



//
// var originData = "排名:1 鱼妖13018|2代 妖力:358 父5815 母6840\n" +
//     "排名:2 翼妖37610|2代 妖力:323 父37581 母37283\n" +
//     "排名:3 翼妖27872|4代 妖力:220 父22712 母26208\n" +
//     "排名:4 胡巴39498|3代 妖力:218 父32245 母31789\n" +
//     "排名:5 血妖24911|1代 妖力:194 父15967 母16047\n" +
//     "排名:6 草妖37654|2代 妖力:187 父36744 母30739\n" +
//     "排名:7 翼妖28931|4代 妖力:175 父22712 母26208\n" +
//     "排名:8 胡巴20045|3代 妖力:170 父13527 母19881\n" +
//     "排名:9 胡巴39669|4代 妖力:169 父37086 母39246\n" +
//     "排名:10 骰妖34177|2代 妖力:164 父32203 母20740\n" +
//     "排名:11 胡巴15258|3代 妖力:160 父13527 母10390\n" +
//     "排名:12 妖王胡巴12991|0代 妖力:155 父0 母0\n" +
//     "排名:13 新年胡巴1625|0代 妖力:154 父0 母0\n" +
//     "排名:14 新年胡巴1634|0代 妖力:154 父0 母0\n" +
//     "排名:15 新年胡巴3504|0代 妖力:154 父0 母0\n" +
//     "排名:16 新年胡巴8570|0代 妖力:154 父0 母0\n" +
//     "排名:17 妖王胡巴10563|0代 妖力:154 父0 母0\n" +
//     "排名:18 妖王胡巴11699|0代 妖力:154 父0 母0\n" +
//     "排名:19 妖王胡巴14925|0代 妖力:154 父0 母0\n" +
//     "排名:20 妖王胡巴24223|0代 妖力:154 父0 母0\n" +
//     "排名:21 妖王胡巴27592|0代 妖力:154 父0 母0\n" +
//     "排名:22 妖王胡巴30392|0代 妖力:154 父0 母0\n" +
//     "排名:23 妖王胡巴32108|0代 妖力:154 父0 母0\n" +
//     "排名:24 妖王胡巴33200|0代 妖力:154 父0 母0\n" +
//     "排名:25 妖王胡巴34015|0代 妖力:154 父0 母0\n" +
//     "排名:26 妖王胡巴36511|0代 妖力:154 父0 母0\n" +
//     "排名:27 妖王胡巴39744|0代 妖力:154 父0 母0\n" +
//     "排名:28 翼妖38379|2代 妖力:146 父35122 母33815\n" +
//     "排名:29 胡巴22798|3代 妖力:143 父18133 母19881\n" +
//     "排名:30 石妖37511|1代 妖力:143 父37487 母37475\n" +
//     "排名:31 胡巴20602|2代 妖力:142 父10075 母19070\n" +
//     "排名:32 胡巴35561|2代 妖力:141 父25639 母30275\n" +
//     "排名:33 怒妖25953|2代 妖力:140 父9388 母23726\n" +
//     "排名:34 胡巴10766|1代 妖力:139 父7059 母10580\n" +
//     "排名:35 胡巴27748|3代 妖力:136 父24786 母23874\n" +
//     "排名:36 胡巴11952|3代 妖力:135 父11623 母9999\n" +
//     "排名:37 胡巴40966|4代 妖力:129 父37086 母39246\n" +
//     "排名:38 竹妖9818|2代 妖力:128 父573 母9209\n" +
//     "排名:39 翼妖38337|3代 妖力:128 父37630 母37768\n" +
//     "排名:40 胡巴20692|9代 妖力:127 父13166 母14770\n" +
//     "排名:41 胡巴35157|4代 妖力:127 父20841 母34281\n" +
//     "排名:42 胡巴24248|1代 妖力:125 父20271 母12681\n" +
//     "排名:43 胡巴41215|5代 妖力:125 父39557 母38675\n" +
//     "排名:44 翼妖24236|3代 妖力:124 父10750 母19483\n" +
//     "排名:45 胡巴34765|4代 妖力:123 父20841 母34281\n" +
//     "排名:46 骰妖40376|2代 妖力:123 父28027 母38723\n" +
//     "排名:47 胡巴9373|1代 妖力:120 父7059 母9132\n" +
//     "排名:48 胡巴15548|6代 妖力:119 父14214 母10955\n" +
//     "排名:49 胡巴37496|3代 妖力:119 父28955 母27362\n" +
//     "排名:50 胡巴38114|3代 妖力:119 父35239 母27287\n" +
//     "排名:51 翼妖10750|2代 妖力:118 父9790 母9362\n" +
//     "排名:52 呆妖41167|2代 妖力:115 父24771 母36273\n" +
//     "排名:53 翼妖11171|1代 妖力:114 父9129 母8269\n" +
//     "排名:54 胡巴38461|3代 妖力:114 父35848 母34906\n" +
//     "排名:55 胡巴35575|3代 妖力:111 父20757 母34906\n" +
//     "排名:56 血妖39087|3代 妖力:111 父38405 母24787\n" +
//     "排名:57 胡巴19823|7代 妖力:110 父16977 母17089\n" +
//     "排名:58 胡巴35571|5代 妖力:109 父25950 母35559\n" +
//     "排名:59 胡巴38215|3代 妖力:109 父25427 母24364\n" +
//     "排名:60 胡巴36461|2代 妖力:107 父25639 母30275\n" +
//     "排名:61 石妖37333|1代 妖力:107 父35771 母9288\n" +
//     "排名:62 胡巴16661|4代 妖力:105 父13521 母12808\n" +
//     "排名:63 草妖35894|1代 妖力:105 父14831 母34543\n" +
//     "排名:64 怒妖8327|4代 妖力:104 父6413 母6707\n" +
//     "排名:65 翼妖34685|5代 妖力:104 父34455 母34576\n" +
//     "排名:66 胡巴35556|3代 妖力:103 父28955 母5440\n" +
//     "排名:67 翼妖39096|2代 妖力:102 父37281 母33815\n" +
//     "排名:68 翼妖8340|1代 妖力:101 父6329 母4107\n" +
//     "排名:69 草妖32766|1代 妖力:100 父23489 母26972\n" +
//     "排名:70 血妖35172|1代 妖力:100 父34700 母34703\n" +
//     "排名:71 胡巴35470|4代 妖力:100 父32349 母35402\n" +
//     "排名:72 翼妖38503|3代 妖力:100 父37745 母28198\n" +
//     "排名:73 花妖16623|0代 妖力:99 父0 母0\n" +
//     "排名:74 血妖31900|1代 妖力:99 父26019 母31823\n" +
//     "排名:75 血妖33969|2代 妖力:99 父32661 母19781\n" +
//     "排名:76 呆妖38080|2代 妖力:99 父33964 母35284\n" +
//     "排名:77 竹妖10494|4代 妖力:98 父6970 母6956\n" +
//     "排名:78 胡巴23676|6代 妖力:98 父23425 母14275\n" +
//     "排名:79 怒妖26169|2代 妖力:98 父20749 母25226\n" +
//     "排名:80 胡巴39045|5代 妖力:98 父29714 母36683\n" +
//     "排名:81 翼妖9072|1代 妖力:97 父1977 母3268\n" +
//     "排名:82 花妖18516|0代 妖力:97 父0 母0\n" +
//     "排名:83 骰妖20427|1代 妖力:97 父16209 母16666\n" +
//     "排名:84 翼妖31143|1代 妖力:97 父29962 母29961\n" +
//     "排名:85 翼妖39250|2代 妖力:97 父38122 母26835\n" +
//     "排名:86 骰妖19010|0代 妖力:96 父0 母0\n" +
//     "排名:87 血妖38600|1代 妖力:96 父38192 母35760\n" +
//     "排名:88 翼妖39115|7代 妖力:96 父37631 母36739\n" +
//     "排名:89 花妖41128|2代 妖力:96 父32794 母35780\n" +
//     "排名:90 胡巴18175|1代 妖力:95 父2454 母16877\n" +
//     "排名:91 草妖25825|1代 妖力:95 父16011 母16029\n" +
//     "排名:92 花妖32168|2代 妖力:95 父25898 母29767\n" +
//     "排名:93 血妖38967|5代 妖力:95 父32413 母34394\n" +
//     "排名:94 翼妖37613|3代 妖力:94 父37414 母37278\n" +
//     "排名:95 呆妖13817|1代 妖力:93 父9282 母6830\n" +
//     "排名:96 怒妖27461|1代 妖力:93 父20296 母16590\n" +
//     "排名:97 胡巴30206|4代 妖力:93 父27834 母29783\n" +
//     "排名:98 骰妖37290|1代 妖力:93 父22591 母34359\n" +
//     "排名:99 呆妖41389|3代 妖力:93 父38985 母40445\n" +
//     "排名:100 怒妖6703|2代 妖力:92 父3109 母5570\n" +
//     "排名:101 竹妖8224|2代 妖力:92 父5299 母6686\n" +
//     "排名:102 胡巴24610|2代 妖力:92 父24248 母23818\n" +
//     "排名:103 骰妖31948|3代 妖力:92 父29762 母27987\n" +
//     "排名:104 血妖32880|2代 妖力:92 父30606 母31700\n" +
//     "排名:105 胡巴40220|4代 妖力:92 父38814 母34810\n" +
//     "排名:106 血妖17060|0代 妖力:91 父0 母0\n" +
//     "排名:107 怒妖19162|2代 妖力:91 父11642 母14994\n" +
//     "排名:108 翼妖20233|0代 妖力:91 父0 母0\n" +
//     "排名:109 胡巴25387|3代 妖力:91 父24757 母11880\n" +
//     "排名:110 草妖41373|2代 妖力:91 父39820 母32566\n" +
//     "排名:111 怒妖20122|0代 妖力:90 父0 母0\n" +
//     "排名:112 花妖21396|3代 妖力:90 父19373 母18299\n" +
//     "排名:113 血妖27871|2代 妖力:90 父27635 母24359\n" +
//     "排名:114 花妖33564|3代 妖力:90 父33509 母31848\n" +
//     "排名:115 胡巴36586|2代 妖力:90 父25373 母36390\n" +
//     "排名:116 胡巴38916|5代 妖力:90 父29714 母36683\n" +
//     "排名:117 草妖5421|4代 妖力:89 父4091 母4773\n" +
//     "排名:118 胡巴24460|4代 妖力:89 父12236 母23275\n" +
//     "排名:119 胡巴13374|6代 妖力:88 父12843 母12561\n" +
//     "排名:120 花妖16628|0代 妖力:88 父0 母0\n" +
//     "排名:121 血妖18315|3代 妖力:88 父17979 母12627\n" +
//     "排名:122 胡巴33704|2代 妖力:88 父12664 母15105\n" +
//     "排名:123 翼妖35530|2代 妖力:88 父8792 母34529\n" +
//     "排名:124 鱼妖7311|3代 妖力:87 父7271 母5591\n" +
//     "排名:125 胡巴19997|10代 妖力:87 父17445 母17594\n" +
//     "排名:126 胡巴25398|3代 妖力:87 父20757 母24506\n" +
//     "排名:127 胡巴25660|3代 妖力:87 父24811 母24696\n" +
//     "排名:128 石妖26044|1代 妖力:87 父26033 母26042\n" +
//     "排名:129 草妖33737|0代 妖力:87 父0 母0\n" +
//     "排名:130 血妖33824|5代 妖力:87 父10124 母33645\n" +
//     "排名:131 石妖35250|0代 妖力:87 父0 母0\n" +
//     "排名:132 胡巴39451|5代 妖力:87 父39268 母39012\n" +
//     "排名:133 鱼妖6590|2代 妖力:86 父4533 母5417\n" +
//     "排名:134 花妖10141|4代 妖力:86 父7398 母5083\n" +
//     "排名:135 胡巴13527|2代 妖力:86 父9810 母8282\n" +
//     "排名:136 呆妖22511|2代 妖力:86 父19646 母18699\n" +
//     "排名:137 翼妖23265|3代 妖力:86 父10750 母15199\n" +
//     "排名:138 花妖24910|1代 妖力:86 父16016 母15875\n" +
//     "排名:139 花妖26291|1代 妖力:86 父20271 母13851\n" +
//     "排名:140 胡巴28828|6代 妖力:86 父27332 母24066\n" +
//     "排名:141 怒妖32721|5代 妖力:86 父32642 母30841\n" +
//     "排名:142 呆妖34454|2代 妖力:86 父14335 母24066\n" +
//     "排名:143 怒妖6481|4代 妖力:85 父5042 母2815\n" +
//     "排名:144 翼妖12590|1代 妖力:85 父12462 母9281\n" +
//     "排名:145 胡巴19880|7代 妖力:85 父19148 母14224\n" +
//     "排名:146 花妖32395|0代 妖力:85 父0 母0\n" +
//     "排名:147 怒妖38971|4代 妖力:85 父38477 母37634\n" +
//     "排名:148 花妖15069|0代 妖力:84 父0 母0\n" +
//     "排名:149 胡巴21579|9代 妖力:84 父19721 母14313\n" +
//     "排名:150 怒妖24396|2代 妖力:84 父18853 母17785\n" +
//     "排名:151 骰妖33534|0代 妖力:84 父0 母0\n" +
//     "排名:152 翼妖38957|1代 妖力:84 父35097 母36814\n" +
//     "排名:153 胡巴16442|5代 妖力:83 父12616 母12454\n" +
//     "排名:154 骰妖20312|1代 妖力:83 父14547 母14768\n" +
//     "排名:155 草妖23185|0代 妖力:83 父0 母0\n" +
//     "排名:156 胡巴24576|2代 妖力:83 父12664 母18267\n" +
//     "排名:157 呆妖27094|1代 妖力:83 父17220 母17199\n" +
//     "排名:158 胡巴35529|4代 妖力:83 父25388 母21748\n" +
//     "排名:159 长老怒妖1626|0代 妖力:82 父0 母0\n" +
//     "排名:160 长老呆妖1628|0代 妖力:82 父0 母0\n" +
//     "排名:161 长老骰妖1632|0代 妖力:82 父0 母0\n" +
//     "排名:162 竹妖10527|1代 妖力:82 父10222 母10224\n" +
//     "排名:163 胡巴12592|4代 妖力:82 父12318 母12109\n" +
//     "排名:164 胡巴15460|5代 妖力:82 父12616 母13926\n" +
//     "排名:165 石妖24731|0代 妖力:82 父0 母0\n" +
//     "排名:166 翼妖39131|2代 妖力:82 父38533 母37830\n" +
//     "排名:167 长老翼妖1630|0代 妖力:81 父0 母0\n" +
//     "排名:168 新年胡巴2454|0代 妖力:81 父0 母0\n" +
//     "排名:169 新年胡巴5104|0代 妖力:81 父0 母0\n" +
//     "排名:170 新年胡巴7059|0代 妖力:81 父0 母0\n" +
//     "排名:171 鱼妖13949|3代 妖力:81 父5781 母9781\n" +
//     "排名:172 胡巴13991|9代 妖力:81 父13784 母13107\n" +
//     "排名:173 胡巴14018|8代 妖力:81 父13874 母12742\n" +
//     "排名:174 胡巴15452|4代 妖力:81 父13521 母12561\n" +
//     "排名:175 草妖16188|1代 妖力:81 父14330 母15756\n" +
//     "排名:176 妖王胡巴20271|0代 妖力:81 父0 母0\n" +
//     "排名:177 骰妖26029|1代 妖力:81 父17495 母15935\n" +
//     "排名:178 胡巴30637|4代 妖力:81 父27834 母21108\n" +
//     "排名:179 呆妖30650|1代 妖力:81 父26628 母22738\n" +
//     "排名:180 妖王胡巴35246|0代 妖力:81 父0 母0\n" +
//     "排名:181 胡巴36303|2代 妖力:81 父24771 母18735\n" +
//     "排名:182 妖王胡巴37964|0代 妖力:81 父0 母0\n" +
//     "排名:183 胡巴3674|2代 妖力:80 父3556 母3140";
//
//
//
// async function parseOriginData() {
//     var config = require('../config/config');
//     config.doConfig();
//
//
//     var lineArray = originData.split("\n");
//     for (var i = 0; i < lineArray.length; i++) {
//         var line = lineArray[i];
//         var mmmm = line.split(" ");
//
//         var m2 = mmmm[1];
//         var m2x = m2.split("|");//
//         var name = m2x[0];
//         var dai = parseInt(m2x[1]);
//
//         var yaoli = mmmm[2].replace(/[^0-9]+/,"");;
//         var id = name.replace(/[^0-9]+/,"");
//         var fid = mmmm[3].replace(/[^0-9]+/,"");
//         var mid = mmmm[4].replace(/[^0-9]+/,"");
//
//         var obj = {
//             "id":id,
//             'name':name,
//             'dai':dai,
//             'yaoli':yaoli,
//             'fid':fid,
//             'mid':mid,
//         };
//
//         await insertMonsterItem(obj);
//
//     }
// }
//
// parseOriginData();
//


module.exports = {
    insertOrUpdate:insertOrUpdate,
    getTop100RankList:getTop100RankList
};

